import Mock from 'mockjs';
import $store from '../../../store/index.js'

const messageUrl = $store.state.mock.url.messageUrl;

const message = {
    'success': true,
    'message|50-50': [
        {
            "data": {
                'title|1': [                                                                        // 消息标题
                    '第一季度时长营销文案总结汇总',
                    '轻盈秀雅市场考察地区研讨结果（一）',
                    '轻盈秀雅市场考察地区研讨结果（二）',
                    '市场部-第二分组-杭州地区4月交易数据汇报',
                    '财务部-前三季度-杭州地区4月交易数据汇报',
                    '小组内部方案初步设想',
                    '市场部-第一分组-杭州地区4月交易数据汇报',
                    '市场部-第四分组-杭州地区4月交易数据汇报',
                    '衣秀维妮相关竞品差异度时长分析及未来预测（一）',
                    '衣秀维妮相关竞品差异度时长分析及未来预测（二）',
                    '衣秀维妮相关竞品差异度时长分析及未来预测（三）',
                    '秋水伊人相关竞品差异度时长分析及未来预测（一）',
                    '秋水伊人相关竞品差异度时长分析及未来预测（二）',
                    '秋水伊人相关竞品差异度时长分析及未来预测（三）',
                    '伊芙丽相关竞品差异度时长分析及未来预测（一）',
                    '伊芙丽相关竞品差异度时长分析及未来预测（二）',
                    '伊芙丽相关竞品差异度时长分析及未来预测（三）',
                    '本月部门内部赏罚制度执行结果及工作总结',
                    '关于下半年服装行业分析(一)',
                    '关于下半年服装行业分析(二)',
                    '杭州地区上半年面辅料加工价格走势',
                    '长三角地区服装设计行业增幅说明',
                    '关于本公司与mimo，伊芙丽等品牌合作款式一览',
                    '上半年天猫营收销量一览',
                ],
                'type|1': ['AD', 'DS', 'PD', 'OR', 'WAR', 'CT', 'PI', 'OT'],                           // 通告类型
                'sender': '@cname',                                                                          // 发送者
                'importance|1': [1, 2, 3, 4, 5],                                                             //重要性
                'status|1': ['unread', 'readed'],                                                 //消息状态
                'content|1': [
                    '本月下旬MIMO定单发布数量为1000单，成交495笔，环比本月上旬(500单)发布单数量上升100%和成交量笔数(450)上升10%，发布单数与成交笔数的增长比率严重不符。 请订单审核部的王总 审查下是否存在重复发单的情况及重复发单的数量。',
                ],
                //获取从2010.1.1-2017.8.1的随机一个时间戳  '2005.01.01':1104508800,'2008.01.01':1199116800,'2012.01.01':1325347200,'2008.01.01':1420041600
                'timestamp|1262275200-1501516800': 0,
                'isquickEdit': false,
                'answer|1': function (n) {
                    return n.context.currentContext.status === 'readed' ? Math.random() <= 0.8 ? '请按照公司相关流程处理有关事务，具体问题可以及时提出，大家一起交流解决' : '' : '';
                }
            }
        }
    ]
};

/**
 * mockTest_message
 * @param url
 * @param tem
 */
const mockTest_message = function (url, tem) {
    Mock.mock(url, tem);
};

export {messageUrl, message, mockTest_message}




